dck982/coffeeflow/firmware/screen/sdkconfig.defaults
# Défauts de projet — module écran (Waveshare ESP32-S3-Touch-LCD-4.3,
# flash 16 Mo, 8 Mo PSRAM). Complète, ne remplace pas, la config par défaut
# d'ESP-IDF v5.1 (voir firmware/IDF_VERSION.md).

CONFIG_IDF_TARGET="esp32s3"

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# PSRAM 8 Mo, nécessaire pour le framebuffer RGB 800x480 (phase 6, LVGL).
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y

# Rollback applicatif : voir sensors/sdkconfig.defaults, même mécanisme.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

CONFIG_ESP_TASK_WDT_EN=y
